esp8266/Arduino/hardware/arduino/sam/system/CMSIS/Device/ATMEL/sam3n/svd/SAM3N0C.svd
              <name>WKUPT11</name>
              <description>Wake Up Input Transition 11</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_TO_LOW</name>
                  <description>a high to low level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH</name>
                  <description>a low to high level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPT12</name>
              <description>Wake Up Input Transition 12</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_TO_LOW</name>
                  <description>a high to low level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH</name>
                  <description>a low to high level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPT13</name>
              <description>Wake Up Input Transition 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_TO_LOW</name>
                  <description>a high to low level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH</name>
                  <description>a low to high level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPT14</name>
              <description>Wake Up Input Transition 14</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_TO_LOW</name>
                  <description>a high to low level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH</name>
                  <description>a low to high level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPT15</name>
              <description>Wake Up Input Transition 15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_TO_LOW</name>
                  <description>a high to low level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_TO_HIGH</name>
                  <description>a low to high level transition on the corresponding wake-up input forces the wake up of the core power supply.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Supply Controller Status Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000800</resetValue>
          <fields>
            <field>
              <name>WKUPS</name>
              <description>WKUP Wake Up Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>no wake up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>at least one wake up due to the assertion of the WKUP pins has occurred since the last read of SUPC_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMWS</name>
              <description>Supply Monitor Detection Wake Up Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>no wake up due to a supply monitor detection has occurred since the last read of SUPC_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>at least one wake up due to a supply monitor detection has occurred since the last read of SUPC_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODRSTS</name>
              <description>Brownout Detector Reset Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>no core brownout rising edge event has been detected since the last read of the SUPC_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>at least one brownout output rising edge event has been detected since the last read of the SUPC_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMRSTS</name>
              <description>Supply Monitor Reset Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>no supply monitor detection has generated a core reset since the last read of the SUPC_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>at least one supply monitor detection has generated a core reset since the last read of the SUPC_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMS</name>
              <description>Supply Monitor Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>no supply monitor detection since the last read of SUPC_SR.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRESENT</name>
                  <description>at least one supply monitor detection since the last read of SUPC_SR.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMOS</name>
              <description>Supply Monitor Output Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>the supply monitor detected VDDIO higher than its threshold at its last measurement.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>the supply monitor detected VDDIO lower than its threshold at its last measurement.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSCSEL</name>
              <description>32-kHz Oscillator Selection Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RC</name>
                  <description>the slow clock, SLCK is generated by the embedded 32-kHz RC oscillator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRYST</name>
                  <description>the slow clock, SLCK is generated by the 32-kHz crystal oscillator.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS0</name>
              <description>WKUP Input Status 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS1</name>
              <description>WKUP Input Status 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS2</name>
              <description>WKUP Input Status 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS3</name>
              <description>WKUP Input Status 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS4</name>
              <description>WKUP Input Status 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS5</name>
              <description>WKUP Input Status 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS6</name>
              <description>WKUP Input Status 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS7</name>
              <description>WKUP Input Status 7</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS8</name>
              <description>WKUP Input Status 8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS9</name>
              <description>WKUP Input Status 9</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS10</name>
              <description>WKUP Input Status 10</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS11</name>
              <description>WKUP Input Status 11</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS12</name>
              <description>WKUP Input Status 12</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS13</name>
              <description>WKUP Input Status 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>the corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake up event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>the corresponding wake-up input was active at the time the debouncer triggered a wake up event.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKUPIS14</name>
              <description>WKUP Input Status 14</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
